Revit 2027 API
BuiltInFailures.RoomFailures.RoomLevelElevs Property
 A [Room]s Upper Limit must be above its Base Level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomLevelElevs { get; }
Public Shared ReadOnly Property RoomLevelElevs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomLevelElevs {
	FailureDefinitionId^ get ();
}
static member RoomLevelElevs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace